git-push-to-create.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-12 Sat 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git push to create</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">git push to create</h1>
<p>
several ways to get push to create, which lets you not have to
manually create a repo
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. git forges</a>
<ul>
<li><a href="#org0000001">1.1. gitea</a></li>
<li><a href="#org0000002">1.2. git.sr.ht</a></li>
</ul>
</li>
<li><a href="#org0000003">2. ssh connect-command</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> git forges</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> gitea</h3>
<div class="outline-text-3" id="text-1-1">
<p>
gitea supports push to create
</p>

<p>
with app.ini
</p>

<pre class="example" id="org0000004">
[repository]
DEFAULT_BRANCH = main
ENABLE_PUSH_TO_CREATE_USER = true
ENABLE_GIT_CREATE_ORG = true
DEFAULT_PUSH_CREATE_PRIVATE = false
</pre>

<p>
or with nixos
</p>

<pre class="example" id="org0000004">
services.gitea = {
  settings.repository.DEFAULT_BRANCH = "main";
  settings.repository.ENABLE_PUSH_CREATE_USER = "true";
  settings.repository.ENABLE_PUSH_CREATE_ORG = "true";
  settings.repository.DEFAULT_PUSH_CREATE_PRIVATE = "false";
};
</pre>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> git.sr.ht</h3>
<div class="outline-text-3" id="text-1-2">
<p>
push to create seems to be enabled by default on sourcehut git, though
it makes the repo private
</p>
</div>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">2.</span> ssh connect-command</h2>
<div class="outline-text-2" id="text-2">
<p>
if you do not want to use a git forge, you can still get push to
create by setting this shell script to your ssh user's connect command
instead of git-shell
</p>

<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

# attempt to stop directory traversal
SSH_ORIGINAL_COMMAND=$(echo "$SSH_ORIGINAL_COMMAND" | sed 's#/##g')

remove_last_quote(){
	handle_repo "${1%\'}"
}

handle_repo(){
	if [ ! -d "$1" ]
	then
		git init --bare "$1" &lt;/dev/null &gt;/dev/null 2&gt;&amp;1
	fi
}

case "$SSH_ORIGINAL_COMMAND" in
	git-receive-pack*)
		remove_last_quote "${SSH_ORIGINAL_COMMAND#git-receive-pack \'}"
		;;
	#git-upload-pack*) # if you want clone to create too
	#	remove_last_quote "${SSH_ORIGINAL_COMMAND#git-upload-pack \'}"
	#	;;
esac

git-shell -c "$SSH_ORIGINAL_COMMAND"
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
